import './PurposePageBody.css';

export default function PurposePageBody() {
  return (
    <section className='purposePageBody'>
      <h1 className='header'> Цель </h1>

      <p>
        На протяжении 1728 недель практически каждый день Я целеустремлённо
        занимался программированием. Временами всё давалось просто, а временами
        ощущение тяжести подавляло меня и мне оставалось только лежать и ничего
        не делать. Однако Я продолжаю работу над собой и ни за что не отступлю.
      </p>

      <p>
        Основная цель данного проекта заключается в том, чтобы взойти на новый
        уровень, реализовав накопленные знания. Согласно модели обучения Дэвида
        Колба, именно реализуя свои знания, пытаясь сделать что-то
        самостоятельно, можно достигнуть существенных успехов. Я постоянно
        думал, что моих знаний недостаточно, чтобы сделать что-нибудь стоящее,
        поэтому я постоянно учился. И я думаю так до сих пор, но теперь я не
        страшусь применить свои навыки.
      </p>

      <p>
        В данном приложении Вы сможете опробовать функционал списка дел,
        реализованного на React с использованием большинства паттернов
        проектирования и разработки React приложений. Можно также рассматривать
        данное приложение в качестве примера для других разработчиков.
      </p>

      <p>С каждым днём Я буду становиться лучше и круче.</p>

      <p>
        <b> А вы?</b>
      </p>
    </section>
  );
}
